<template>
    <v-container>
        <div class="display-2 ma-3">Добро пожаловать!</div>
        <hr>
        <div class="body-1">
            <div class="display-1 ma-3">О&nbsp;приложении</div>
            <div class="title mb-3">Приложение служит для быстрого создания публичных ссылок на&nbsp;файлы.</div>

            <div class="subheading">Как использовать:</div>
            <ul>
                <li>
                    Чтобы создать ссылку, нужно зайти сюда и&nbsp;нажать на&nbsp;кнопку &laquo;создать ссылку&raquo;
                    напротив имени файла
                </li>
                <li>
                    Чтобы скопировать ссылку в&nbsp;буфер обмена, нужно нажать &laquo;скопировать ссылку&raquo; напротив
                    имени файла
                </li>
                <li>
                    Ссылка существует 5&nbsp;дней (может быть изменено администратором), затем нужно будет создать новую
                    ссылку, если это необходимо.
                </li>
                <li>
                    Чтобы досрочно удалить ссылку, нужно удалить файл из&nbsp;папки на&nbsp;файловой системе.
                </li>
                <li>
                    <p class="body-2">
                        Если файл по&nbsp;какой-то причине пропадет с&nbsp;файловой системы, то&nbsp;и&nbsp;ссылка тоже
                        перестанет работать,
                        так как это прямой доступ к&nbsp;файлу. Файл не&nbsp;копируется в&nbsp;облако, и&nbsp;не&nbsp;кодируется,
                        и&nbsp;вообще
                        никаких манипуляций над файлами не&nbsp;производится. Таким образом ссылка создается мнгновенно.
                    </p>
                </li>
                <li>
                    Чтобы создать ссылку на&nbsp;папку, приложение предварительно ее&nbsp;архивирует без сжатия, это
                    занимает
                    некоторое время. Будьте терпеливы!
                </li>
                <li>
                    Сервис протестирован в&nbsp;браузерах: Google Chrome, Mozilla Firefox. Прочие браузеры могут давать
                    неожиданные результаты, просьба по&nbsp;возможности не&nbsp;пользоваться плохими и&nbsp;старыми
                    браузерами.
                </li>
            </ul>
        </div>
    </v-container>
</template>

<script>
    export default {
        name: "About"
    }
</script>

<style scoped>

</style>